{"id":5991,"date":"2018-05-25T10:36:37","date_gmt":"2018-05-25T10:36:37","guid":{"rendered":"https:\/\/www.prime-optical.com\/?page_id=5991"},"modified":"2019-10-23T14:19:11","modified_gmt":"2019-10-23T14:19:11","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/primepharmacyrec.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p><strong>Prime Recruitment Consultancy T\/A Prime Pharmacy Privacy Policy<\/strong><br \/>\nAt Prime Recruitment Consultancy Ltd T\/A Prime Pharmacy we are committed to protecting and respecting your privacy. This privacy policy sets out how Prime Pharmacy uses, protects and processes any information that we collect from you or that you provide to us.<\/p>\n<p>Prime Pharmacy is committed to ensuring that your privacy is protected. Should we ask you to provide certain information by which you can be identified when using our recruitment services, then you can be assured that it will only be used in accordance with this privacy policy.<\/p>\n<p>The General Data Protection Regulation (GDPR) (Regulation (EU) 2016\/679) is a new regulation which replaces the Data Protection Regulation (Directive 95\/46\/EC) The Regulation aims to harmonise data protection legislation across EU member states, enhancing privacy rights for individuals and providing a strict framework within which commercial organisations can legally operate.<\/p>\n<p>Even though the UK has expressed its intention to leave the EU in March 2019, the GDPR will be continue to be applicable in the UK from 6th September 2019. The Government intends for the GDPR to continue in UK law post Brexit and has also introduced a Data Protection Bill to replace the current Data Protection Act in due course.<br \/>\nPlease read the following carefully to understand our views and practices regarding your personal data and how we will treat it.<\/p>\n<p>For the purposes of data protection legislation in force from time to time the data controller is Prime Recruitment Consultancy Ltd T\/A Prime Pharmacy Registered Address: 20 – 22 Wenlock Road, London, N1 7GU | Company Registration:   11224950.<\/p>\n<p>Who we are and what we do<\/p>\n<p>We are a recruitment agency and recruitment business as defined in the Employment Agencies and Employment Businesses Regulations 2003 (Prime Recruitment Consultancy Ltd T\/A Prime Pharmacy). We collect the personal data of the following types of people to allow us to undertake our business;<br \/>\nProspective and placed candidates for permanent or temporary roles;<br \/>\nProspective and live client contacts;<br \/>\nSupplier contacts to support our services;<br \/>\nEmployees, consultants, temporary workers.<\/p>\n<p>WE COLLECT INFORMATION ABOUT YOU SOLELY FOR THE PURPOSES OF CARRYING OUT OUR CORE BUSINESS AND ANCILLARY ACTIVITIES.<\/p>\n<p>What we collect from you<\/p>\n<p>Prime Pharmacy collects Personal Data directly from you (via email, website forms, phone, and email or otherwise) as well as from other available sources to the extent relevant and permitted under the GDPR legislation. Subject to this applicable law we may collect the following information: <\/p>\n<p>name and job title<br \/>\ncontact information including phone number and email address<br \/>\nlinks to your professional profiles available in the public domain e.g LinkedIn and corporate website<br \/>\nyour competences, skills, experience and education, e.g. your CV or resume, previous employments, educational details and qualifications, third party references<br \/>\nyour preferences, e.g. preferred country of employment, areas of interest as well as your preferred ways to be contacted by Prime Pharmacy<br \/>\nother information relevant to roles and relevant industry news<br \/>\nother information, such as information found from public sources as well as information depending on the position you are applying for, and where necessary for the recruitment activities. This will only be in the case of legitimate interest (please see Our Legitimate Business Interests below)<\/p>\n<p>We will only collect sensitive personal data about you when absolutely necessary for the recruitment process. We will only process this data if you have given your consent for us to do so.<\/p>\n<p>Our Legitimate Business Interests<\/p>\n<p>Our legitimate interests in collecting and retaining your personal data are described below:<br \/>\nAs a recruitment business and recruitment agency, we introduce candidates to clients for permanent employment, temporary worker placements or independent professional contracts.  The exchange of personal data of our candidates and our client contacts is a fundamental, essential part of this process.<br \/>\nIn order to support our candidates’ career aspirations and our clients’ resourcing needs we require a database of candidate and client personal data containing historical information as well as current resourcing requirements.<br \/>\nTo maintain, expand and develop our business we need to record the personal data of prospective candidates and client contacts. Due to the nature of our business, we will never store your personal data for a period longer than 6 years without having meaningful contact with you during this time period. If you have not received any meaningful contact from us in 6 years or more your personal information will be deleted from our systems. “Meaningful contact” means, for example, any form of contact between us in relation to the Company assisting\/providing recruitment services to you.<\/p>\n<p>Technical Information<br \/>\nWhen you access our services online, our web servers automatically create records of your visit. These records typically include IP-address, access times, the sites linked from, pages visited, the links and features used, the content viewed or requested, browser or application type, language and other such information.<\/p>\n<p>Purposes of the processing and the legal basis for the processing<br \/>\nPrime Pharmacy will collect, use, store and otherwise process your Personal Data for the purposes of Prime Pharmacy’s recruitment or resourcing activities. Additionally, your personal data may be processed for other purposes such as relevant information we think will be of legitimate interest to you. We may also use your personal data to carry out our obligations we have entered into between you and us.<br \/>\nOur legal basis for the processing of personal data is our legitimate business interests, described in more detail below, although we will also rely on contract, legal obligation and consent for specific uses of data.<br \/>\nWe will rely on legal obligation if we are legally required to hold information on to you to fulfil our legal obligations.<br \/>\nWe will in some circumstances rely on consent for particular uses of your data and you will be asked for your express consent, if legally required.  Examples of when consent may be the lawful basis for processing include permission to introduce you to a client (if you are a candidate) or if we need to process ‘special categories’ of personal information.<br \/>\nShould we want, need or rely on consent to lawfully process your data we will request your consent orally, by email, or by an online process for the specific activity that we require consent for and record your response on our system. Whenever necessary and subject to statutory record-keeping requirements, Prime Pharmacy will delete and\/or anonymise Personal Data that is no longer needed. If there has not been any recent activity between yourself and Prime Pharmacy, we may delete your profile after a reasonable time in compliance with the GDPR legislation.<br \/>\nIn further detail, Prime Pharmacy will process your Personal Data for the following purposes:<\/p>\n<p>Communicating with you, in context of recruitment activities, such as:<br \/>\nTo obtain additional information where necessary;<br \/>\nTo inform you of available vacancies and relevant industry news;<br \/>\nTo provide you with information relating to your application and to fulfil your requests.<\/p>\n<p>Managing recruitment and resourcing activities, including activities related to organisational planning. In the course of recruitment activities, we may use your information:<br \/>\nTo set up and conduct interviews and assessments;<br \/>\nTo evaluate, select and recruit applicants;<br \/>\nTo conduct background and credit checks and assessments as required or permitted by applicable local law;<br \/>\nTo contact third-party references provided by you to evaluate your previous performances.<br \/>\nOr as otherwise necessary in context of recruitment activities.<\/p>\n<p>Development of services<br \/>\nWe may use your Personal Data to develop and improve our recruitment processes, websites and other related services. Where feasible, we use aggregated anonymous information in context of the development activities.<\/p>\n<p>Legal and regulatory compliance, including obtaining and releasing Personal Data as required by law, judicial organizations or practice in order to comply with legal obligations imposed on us.<\/p>\n<p>Transfer of your Personal Data<br \/>\nPrime Pharmacy will not sell, lease, rent or otherwise disclose your Personal Data unless you have given explicit consent. Prime Pharmacy may share your Personal Data if you have given your informed consent for Prime Pharmacy to do so.<\/p>\n<p>We do not undertake automated decision making or profiling. We do however use our systems to search and identify personal data in accordance with the parameters set by a person. A person will always be involved in the decision-making process.<\/p>\n<p>Transfer outside the EEA – We may from time to time pass your personal data to clients outside the EEA if you have given your explicit consent for us to do so in relation to a role. No personal information is otherwise stored outside of the EEA.<\/p>\n<p>Security and controlling your personal information<br \/>\nWe are committed to ensuring that your information is secure although unfortunately, the transmission of information via the internet is not completely secure. Although we will do our best to protect your personal data, we cannot guarantee the security of your data transmitted to our site; any transmission is at your own risk. Once we have received your information, in order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online.<\/p>\n<p>We take reasonable steps to keep the personal data we possess accurate and to delete incorrect or unnecessary personal data. With respect to the processing of your Personal Data, you will always have the rights as provided by applicable local law. In addition, this Policy provides you the right to know what personal data we hold about you; to request incomplete, incorrect, unnecessary or outdated personal data deleted or updated as well as to object to Prime Pharmacy’s processing of your Personal Data on compelling legitimate grounds. There may be certain categories of information prescribed by applicable local law that Prime Pharmacy may lawfully withhold.<br \/>\nWe will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about roles and market information which we think you may find interesting if you consent for Prime Pharmacy to do so.<\/p>\n<p>Retention of your data<br \/>\nWe understand our legal duty to retain accurate data and only retain personal data for as long as we need it for our legitimate business interests and that you are happy for us to do so.  Accordingly, we will re-assess our ‘Legitimate Interests Needs Balancing Act’ on a yearly basis and run data routines to remove data that we no longer have a legitimate business interest in maintaining.<br \/>\nWe segregate our data so that we keep different types of data for different time periods.  The criteria we use to determine whether we should retain your personal data includes:<br \/>\nthe nature of the personal data;<br \/>\nits perceived accuracy;<br \/>\nour legal obligations;<br \/>\nwhether an interview or placement has been arranged; and<br \/>\nour recruitment expertise and knowledge of the industry by country, sector and job role.<\/p>\n<p>We may archive part or all of your personal data or retain it on our financial systems only, deleting all or part of it from our main Customer Relationship Manager (CRM) system. We may pseudonymise parts of your data, particularly following a request for suppression or deletion of your data, to ensure that we do not re-enter your personal data on to our database unless requested to do so.<br \/>\nFor your information, Pseudonymised Data is created by taking identifying fields within a database and replacing them with artificial identifiers, or pseudonyms.<br \/>\nOur retention notice will be available on 6th September 2019 and onwards.<\/p>\n<p>Your rights<\/p>\n<p>You may choose to restrict the collection or use of your personal information in the following ways:<br \/>\nwhenever you are asked to fill in a form on the website, look for the box that you can click to indicate what you would like your personal data to be processed for<br \/>\nif you have previously agreed to Prime Pharmacy  using and or storing your personal information you may change your mind at any time by writing to or emailing us at hello@primepharmacyrec.com or  Prime Recruitment Consultancy T\/A Prime Pharmacy 20 – 22 Wenlock Road, London, N1 7GU | Company Registration:   11224950<\/p>\n<p>Under the GDPR and Prime Pharmacy policies and procedures, you have the right to:<br \/>\n Request correction of the personal information that we hold about you. This enables you to have any incomplete or inaccurate information we hold about you corrected.<br \/>\nRequest erasure of your personal information. This enables you to ask us to delete or remove personal information where there is no good reason for us continuing to process it. You also have the right to ask us to delete or remove your personal information where you have exercised your right to object to processing (see below).<br \/>\nObject to processing of your personal information where we are relying on a legitimate interest (or those of a third party) and there is something about your particular situation which makes you want to object to processing on this ground. You also have the right to object where we are processing your personal information for direct marketing purposes.<br \/>\nRequest the restriction of processing of your personal information. This enables you to ask us to suspend the processing of personal information about you, for example, if you want us to establish its accuracy or the reason for processing it.<br \/>\nRequest the transfer of your personal information to another party in certain formats, if practicable.<br \/>\nThe Data Protection Act 1998 and the GDPR give you the right to access information held about you. We also encourage you to contact us to ensure your data is accurate and complete. For any of the above please write to Prime Recruitment Consultancy T\/A Prime Pharmacy 20 – 22 Wenlock Road, London, N1 7GU | Company Registration:   11224950 or email hello@primepharmacyrec.com. If you believe that any information, we are holding on you is incorrect or incomplete, please write to or email us as soon as possible, at the above address. We will promptly correct any information found to be incorrect.<br \/>\nPrime Pharmacy may change this policy from time to time by updating this page. You should check this page from time to time to ensure that you are happy with any changes. This policy is effective from 6th September 2019.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Prime Recruitment Consultancy T\/A Prime Pharmacy Privacy Policy At Prime Recruitment Consultancy Ltd T\/A Prime Pharmacy we are committed to protecting and respecting your privacy. This privacy policy sets out&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy - Prime Pharmacy<\/title>\n<meta name=\"description\" content=\"Prime Recruitment Consultancy T\/A Prime Optical Privacy Policy we are committed to protecting and respecting your privacy\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/primepharmacyrec.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy - Prime Pharmacy\" \/>\n<meta property=\"og:description\" content=\"Prime Recruitment Consultancy T\/A Prime Optical Privacy Policy we are committed to protecting and respecting your privacy\" \/>\n<meta property=\"og:url\" content=\"https:\/\/primepharmacyrec.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"Prime Pharmacy\" \/>\n<meta property=\"article:modified_time\" content=\"2019-10-23T14:19:11+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Estimated reading time\">\n\t<meta name=\"twitter:data1\" content=\"12 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/primepharmacyrec.com\/#organization\",\"name\":\"Prime Pharmacy\",\"url\":\"https:\/\/primepharmacyrec.com\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/primepharmacyrec.com\/#logo\",\"inLanguage\":\"en-GB\",\"url\":\"https:\/\/primepharmacyrec.com\/wp-content\/uploads\/2018\/04\/Prime-Optical-Logo-black.png\",\"contentUrl\":\"https:\/\/primepharmacyrec.com\/wp-content\/uploads\/2018\/04\/Prime-Optical-Logo-black.png\",\"width\":650,\"height\":321,\"caption\":\"Prime Pharmacy\"},\"image\":{\"@id\":\"https:\/\/primepharmacyrec.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/primepharmacyrec.com\/#website\",\"url\":\"https:\/\/primepharmacyrec.com\/\",\"name\":\"Prime Pharmacy\",\"description\":\"Your Pharmacy Recruitment Consultancy of Choice\",\"publisher\":{\"@id\":\"https:\/\/primepharmacyrec.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/primepharmacyrec.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/primepharmacyrec.com\/privacy-policy\/#webpage\",\"url\":\"https:\/\/primepharmacyrec.com\/privacy-policy\/\",\"name\":\"Privacy Policy - Prime Pharmacy\",\"isPartOf\":{\"@id\":\"https:\/\/primepharmacyrec.com\/#website\"},\"datePublished\":\"2018-05-25T10:36:37+00:00\",\"dateModified\":\"2019-10-23T14:19:11+00:00\",\"description\":\"Prime Recruitment Consultancy T\/A Prime Optical Privacy Policy we are committed to protecting and respecting your privacy\",\"breadcrumb\":{\"@id\":\"https:\/\/primepharmacyrec.com\/privacy-policy\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/primepharmacyrec.com\/privacy-policy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/primepharmacyrec.com\/privacy-policy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/primepharmacyrec.com\/\",\"url\":\"https:\/\/primepharmacyrec.com\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@id\":\"https:\/\/primepharmacyrec.com\/privacy-policy\/#webpage\"}}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/pages\/5991"}],"collection":[{"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/comments?post=5991"}],"version-history":[{"count":3,"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/pages\/5991\/revisions"}],"predecessor-version":[{"id":6905,"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/pages\/5991\/revisions\/6905"}],"wp:attachment":[{"href":"https:\/\/primepharmacyrec.com\/wp-json\/wp\/v2\/media?parent=5991"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}